#include <bits/stdc++.h>
#define ll long long
using namespace std;
ll n, x, ans;
int main()
{
	// freopen("score.in", "r", stdin);
	// freopen("score.out", "w", stdout);
	scanf("%lld", &n);
	for (ll i = 1; i <= n; i++)
	{
		scanf("%lld", &x);
		ans += ((x * i)%1000000007 * (n - i + 1)) % 1000000007;
		//1e7*1e7 -> 1e14
		//2e9
		ans %= 1000000007;
	}
	printf("%lld", ans);
	return 0;
}
//A 每个区间的和
//一个区间的权值定义为其中每个元素的和
//问每个区间的和是多少
//O(n^2)
//枚举区间的左端点，枚举区间的右端点，通过前缀和的方式在O(1)的复杂度内计算一个区间的和
//每个区间去计算和
//每个元素在多少个区间当中,权值和就等于元素在区间中出现的个数*元素的权值

//3,5,2,1,4
//3: [1,1][1,2][1,3][1,4][1,5]  5  3*5=15
//5: [1,2][1,3][1,4][1,5][2,2][2,3][2,4][2,5] 8*5=40 

//怎么计算一个元素在多少个区间当中出现了 
//i*(n-i+1)个区间包含第i个元素
//1ll*i*(n-i+1)*w[i] 

//从前缀和的角度
//[l,r]  S[r]-S[l-1]
//S[r]被加了多少次被减了多少次
//S[r]  -> l=1,2,3,4,...r   一共被加了r次 +r*S[r]
//S[l-1] -> r=l,l+1,l+2,...,n 一共被减了(n-l+1)次 -(n-l+1)*S[l-1] 
 
